-- 1. 党政管理部门 dept_type=1
INSERT INTO sys_department (biz_id, dept_name, dept_type, dept_sort) VALUES
('DEPT1001', '党政办公室', 1, 1),
('DEPT1002', '组织部', 1, 2),
('DEPT1003', '宣传部', 1, 3),
('DEPT1004', '统战部', 1, 4),
('DEPT1005', '纪委办公室', 1, 5),
('DEPT1006', '工会', 1, 6),
('DEPT1007', '团委', 1, 7),
('DEPT1008', '学生工作部(处)', 1, 8),
('DEPT1009', '武装部（保卫处）', 1, 9),
('DEPT1010', '人事处（党委教师工作部）', 1, 10),
('DEPT1011', '发展规划处', 1, 11),
('DEPT1012', '招生就业处（社会合作处）', 1, 12),
('DEPT1013', '教务处', 1, 13),
('DEPT1014', '科研处', 1, 14),
('DEPT1015', '学科建设处', 1, 15),
('DEPT1016', '研究生部', 1, 16),
('DEPT1017', '计划财务处', 1, 17),
('DEPT1018', '审计处', 1, 18),
('DEPT1019', '国有资产管理处', 1, 19),
('DEPT1020', '离退休工作处', 1, 20),
('DEPT1021', '后勤管理处', 1, 21);

-- 2. 教学学院 dept_type=2
INSERT INTO sys_department (biz_id, dept_name, dept_type, dept_sort) VALUES
('DEPT2001', '地球科学学院', 2, 1),
('DEPT2002', '石油工程学院', 2, 2),
('DEPT2003', '化学化工学院', 2, 3),
('DEPT2004', '机械科学与工程学院', 2, 4),
('DEPT2005', '电气信息工程学院', 2, 5),
('DEPT2006', '计算机与信息技术学院', 2, 6),
('DEPT2007', '土木建筑工程学院', 2, 7),
('DEPT2008', '经济管理学院', 2, 8),
('DEPT2009', '物理与电子工程学院', 2, 9),
('DEPT2010', '数学与统计学院', 2, 10),
('DEPT2011', '人文科学学院', 2, 11),
('DEPT2012', '马克思主义学院', 2, 12),
('DEPT2013', '外国语学院', 2, 13),
('DEPT2014', '艺术学院', 2, 14),
('DEPT2015', '体育部', 2, 15),
('DEPT2016', '新能源与材料学院', 2, 16),
('DEPT2017', '继续教育学院', 2, 17),
('DEPT2018', '秦皇岛分校', 2, 18);

-- 3. 科研机构 dept_type=3
INSERT INTO sys_department (biz_id, dept_name, dept_type, dept_sort) VALUES
('DEPT3001', '非常规油气研究院', 3, 1),
('DEPT3002', '三亚海洋油气研究院', 3, 2),
('DEPT3003', '环渤海能源研究院', 3, 3),
('DEPT3004', '人工智能能源研究院', 3, 4),
('DEPT3005', '大庆精神教育研究中心', 3, 5);

-- 4. 教辅直属单位 dept_type=4
INSERT INTO sys_department (biz_id, dept_name, dept_type, dept_sort) VALUES
('DEPT4001', '人才服务中心', 4, 1),
('DEPT4002', '国际交流合作中心', 4, 2),
('DEPT4003', '图书馆', 4, 3),
('DEPT4004', '现代教育技术中心', 4, 4),
('DEPT4005', '实验室与设备管理中心', 4, 5),
('DEPT4006', '教学质量监控与评估中心', 4, 6),
('DEPT4007', '高等教育研究中心', 4, 7),
('DEPT4008', '国家大学科技园', 4, 8);